/* automatically generated by rust-bindgen */

pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type size_t = __darwin_size_t;
pub type ssize_t = __darwin_ssize_t;
pub const Gsasl_rc_GSASL_OK: Gsasl_rc = 0;
pub const Gsasl_rc_GSASL_NEEDS_MORE: Gsasl_rc = 1;
pub const Gsasl_rc_GSASL_UNKNOWN_MECHANISM: Gsasl_rc = 2;
pub const Gsasl_rc_GSASL_MECHANISM_CALLED_TOO_MANY_TIMES: Gsasl_rc = 3;
pub const Gsasl_rc_GSASL_MALLOC_ERROR: Gsasl_rc = 7;
pub const Gsasl_rc_GSASL_BASE64_ERROR: Gsasl_rc = 8;
pub const Gsasl_rc_GSASL_CRYPTO_ERROR: Gsasl_rc = 9;
pub const Gsasl_rc_GSASL_SASLPREP_ERROR: Gsasl_rc = 29;
pub const Gsasl_rc_GSASL_MECHANISM_PARSE_ERROR: Gsasl_rc = 30;
pub const Gsasl_rc_GSASL_AUTHENTICATION_ERROR: Gsasl_rc = 31;
pub const Gsasl_rc_GSASL_INTEGRITY_ERROR: Gsasl_rc = 33;
pub const Gsasl_rc_GSASL_NO_CLIENT_CODE: Gsasl_rc = 35;
pub const Gsasl_rc_GSASL_NO_SERVER_CODE: Gsasl_rc = 36;
pub const Gsasl_rc_GSASL_NO_CALLBACK: Gsasl_rc = 51;
pub const Gsasl_rc_GSASL_NO_ANONYMOUS_TOKEN: Gsasl_rc = 52;
pub const Gsasl_rc_GSASL_NO_AUTHID: Gsasl_rc = 53;
pub const Gsasl_rc_GSASL_NO_AUTHZID: Gsasl_rc = 54;
pub const Gsasl_rc_GSASL_NO_PASSWORD: Gsasl_rc = 55;
pub const Gsasl_rc_GSASL_NO_PASSCODE: Gsasl_rc = 56;
pub const Gsasl_rc_GSASL_NO_PIN: Gsasl_rc = 57;
pub const Gsasl_rc_GSASL_NO_SERVICE: Gsasl_rc = 58;
pub const Gsasl_rc_GSASL_NO_HOSTNAME: Gsasl_rc = 59;
pub const Gsasl_rc_GSASL_NO_CB_TLS_UNIQUE: Gsasl_rc = 65;

  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_base64_from(
    in_: *const ::std::os::raw::c_char,
    inlen: size_t,
    out: *mut *mut ::std::os::raw::c_char,
    outlen: *mut size_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_nonce(data: *mut ::std::os::raw::c_char, datalen: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_random(data: *mut ::std::os::raw::c_char, datalen: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_md5(
    in_: *const ::std::os::raw::c_char,
    inlen: size_t,
    out: *mut *mut ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_hmac_md5(
    key: *const ::std::os::raw::c_char,
    keylen: size_t,
    in_: *const ::std::os::raw::c_char,
    inlen: size_t,
    outhash: *mut *mut ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_sha1(
    in_: *const ::std::os::raw::c_char,
    inlen: size_t,
    out: *mut *mut ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_hmac_sha1(
    key: *const ::std::os::raw::c_char,
    keylen: size_t,
    in_: *const ::std::os::raw::c_char,
    inlen: size_t,
    outhash: *mut *mut ::std::os::raw::c_char,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_free(ptr: *mut ::std::os::raw::c_void);
}
pub type Gsasl_init_function =
  ::std::option::Option<unsafe extern "C" fn(ctx: *mut Gsasl) -> ::std::os::raw::c_int>;
pub type Gsasl_done_function = ::std::option::Option<unsafe extern "C" fn(ctx: *mut Gsasl)>;
pub type Gsasl_start_function = ::std::option::Option<
  unsafe extern "C" fn(
    sctx: *mut Gsasl_session,
    mech_data: *mut *mut ::std::os::raw::c_void,
  ) -> ::std::os::raw::c_int,
>;
pub type Gsasl_step_function = ::std::option::Option<
  unsafe extern "C" fn(
    sctx: *mut Gsasl_session,
    mech_data: *mut ::std::os::raw::c_void,
    input: *const ::std::os::raw::c_char,
    input_len: size_t,
    output: *mut *mut ::std::os::raw::c_char,
    output_len: *mut size_t,
  ) -> ::std::os::raw::c_int,
>;
pub type Gsasl_finish_function = ::std::option::Option<
  unsafe extern "C" fn(sctx: *mut Gsasl_session, mech_data: *mut ::std::os::raw::c_void),
>;
pub type Gsasl_code_function = ::std::option::Option<
  unsafe extern "C" fn(
    sctx: *mut Gsasl_session,
    mech_data: *mut ::std::os::raw::c_void,
    input: *const ::std::os::raw::c_char,
    input_len: size_t,
    output: *mut *mut ::std::os::raw::c_char,
    output_len: *mut size_t,
  ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Gsasl_mechanism_functions {
  pub init: Gsasl_init_function,
  pub done: Gsasl_done_function,
  pub start: Gsasl_start_function,
  pub step: Gsasl_step_function,
  pub finish: Gsasl_finish_function,
  pub encode: Gsasl_code_function,
  pub decode: Gsasl_code_function,
}
#[test]
fn bindgen_test_layout_Gsasl_mechanism_functions() {
  assert_eq!(
    ::std::mem::size_of::<Gsasl_mechanism_functions>(),
    56usize,
    concat!("Size of: ", stringify!(Gsasl_mechanism_functions))
  );
  assert_eq!(
    ::std::mem::align_of::<Gsasl_mechanism_functions>(),
    8usize,
    concat!("Alignment of ", stringify!(Gsasl_mechanism_functions))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism_functions>())).init as *const _ as usize },
    0usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism_functions), "::", stringify!(init))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism_functions>())).done as *const _ as usize },
    8usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism_functions), "::", stringify!(done))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism_functions>())).start as *const _ as usize },
    16usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism_functions), "::", stringify!(start))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism_functions>())).step as *const _ as usize },
    24usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism_functions), "::", stringify!(step))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism_functions>())).finish as *const _ as usize },
    32usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism_functions), "::", stringify!(finish))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism_functions>())).encode as *const _ as usize },
    40usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism_functions), "::", stringify!(encode))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism_functions>())).decode as *const _ as usize },
    48usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism_functions), "::", stringify!(decode))
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Gsasl_mechanism {
  pub name: *const ::std::os::raw::c_char,
  pub client: Gsasl_mechanism_functions,
  pub server: Gsasl_mechanism_functions,
}
#[test]
fn bindgen_test_layout_Gsasl_mechanism() {
  assert_eq!(
    ::std::mem::size_of::<Gsasl_mechanism>(),
    120usize,
    concat!("Size of: ", stringify!(Gsasl_mechanism))
  );
  assert_eq!(
    ::std::mem::align_of::<Gsasl_mechanism>(),
    8usize,
    concat!("Alignment of ", stringify!(Gsasl_mechanism))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism>())).name as *const _ as usize },
    0usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism), "::", stringify!(name))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism>())).client as *const _ as usize },
    8usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism), "::", stringify!(client))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<Gsasl_mechanism>())).server as *const _ as usize },
    64usize,
    concat!("Offset of field: ", stringify!(Gsasl_mechanism), "::", stringify!(server))
  );
}
extern "C" {
  pub fn gsasl_register(ctx: *mut Gsasl, mech: *const Gsasl_mechanism) -> ::std::os::raw::c_int;
}
pub type Gsasl_ctx = Gsasl;
pub type Gsasl_session_ctx = Gsasl_session;
extern "C" {
  pub fn gsasl_client_listmech(
    ctx: *mut Gsasl,
    out: *mut ::std::os::raw::c_char,
    outlen: *mut size_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_server_listmech(
    ctx: *mut Gsasl,
    out: *mut ::std::os::raw::c_char,
    outlen: *mut size_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_client_step(
    sctx: *mut Gsasl_session,
    input: *const ::std::os::raw::c_char,
    input_len: size_t,
    output: *mut ::std::os::raw::c_char,
    output_len: *mut size_t,
  ) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn gsasl_client_step_base64(
    sctx: *mut Gsasl_session,
    b64input: *const ::std::os::raw::c_char,
    b64output: *mut ::std::os::raw::c_char,
